app/views/consumers/show.html.erb


    <% @consumer.influences.each do |influence| %>
---
SELECT "influences".* FROM "influences" WHERE "influences"."consumer_id" = 2 AND "influences"."id" = ? LIMIT 1  [["id", 0]]


  <h3> <%= @consumer.influences.first.brand.category.title %></h3>
---
SELECT "brands".* FROM "brands" WHERE "brands"."influence_id" = 4 LIMIT 1
SELECT "influences".* FROM "influences" WHERE "influences"."brand_id" = 5