app/views/influences/_form.html.erb

    <div>
      <%= collection_select(:influence, :brand_id, Brand.all, :id, :name, :prompt => true) %>
---
SELECT "brands".* FROM "brands"