our_stuff/app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 17 Mar 2012 23:14:22 UTC +00:00], ["title", "tech"], ["updated_at", Sat, 17 Mar 2012 23:14:22 UTC +00:00]]
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @category = Category.find(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def destroy
    @category = Category.find(params[:id])