our_stuff/app/controllers/consumers_controller.rb

  def index
    @consumers = Consumer.all
---
SELECT "consumers".* FROM "consumers"

  def show
    @consumer = Consumer.find(params[:id])
---
SELECT "consumers".* FROM "consumers" WHERE "consumers"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @consumer = Consumer.find(params[:id])
---
SELECT "consumers".* FROM "consumers" WHERE "consumers"."id" = ? LIMIT 1  [["id", "5"]]

  def create
    @consumer = Consumer.new(params[:consumer])

    respond_to do |format|
      if @consumer.save
---
INSERT INTO "consumers" ("age", "created_at", "gender", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["age", nil], ["created_at", Sat, 17 Mar 2012 21:34:23 UTC +00:00], ["gender", ""], ["name", "Ralf"], ["updated_at", Sat, 17 Mar 2012 21:34:23 UTC +00:00]]

  def update
    @consumer = Consumer.find(params[:id])
---
SELECT "consumers".* FROM "consumers" WHERE "consumers"."id" = ? LIMIT 1  [["id", "5"]]

  def destroy
    @consumer = Consumer.find(params[:id])
    @consumer.destroy
---
SELECT "consumers".* FROM "consumers" WHERE "consumers"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "consumers" WHERE "consumers"."id" = ?  [["id", 1]]