our_stuff/app/controllers/facebooks_controller.rb

SELECT "facebooks".* FROM "facebooks"
---
  def index
    @facebooks = Facebook.all

SELECT "facebooks".* FROM "facebooks" WHERE "facebooks"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @facebook = Facebook.find(params[:id])

SELECT "facebooks".* FROM "facebooks" WHERE "facebooks"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @facebook = Facebook.find(params[:id])

INSERT INTO "facebooks" ("appid", "appsecrect", "consumer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["appid", "MyString"], ["appsecrect", "MyString"], ["consumer_id", nil], ["created_at", Sun, 18 Mar 2012 00:38:20 UTC +00:00], ["updated_at", Sun, 18 Mar 2012 00:38:20 UTC +00:00]]
---
  def create
    @facebook = Facebook.new(params[:facebook])

    respond_to do |format|
      if @facebook.save

SELECT "facebooks".* FROM "facebooks" WHERE "facebooks"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @facebook = Facebook.find(params[:id])

SELECT "facebooks".* FROM "facebooks" WHERE "facebooks"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "facebooks" WHERE "facebooks"."id" = ?  [["id", 980190962]]
---
  def destroy
    @facebook = Facebook.find(params[:id])
    @facebook.destroy