app/controllers/brands_controller.rb

  def index
    @brands = Brand.all
---
SELECT "brands".* FROM "brands"

  def show
    @brand = Brand.find(params[:id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @brand = Brand.find(params[:id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @category = Category.find(params[:category_id])
    @brand = @category.brands.build(params[:brand])

    respond_to do |format|
      if @brand.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "brands" ("created_at", "name", "page", "updated_at", "website") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 17 Mar 2012 23:14:34 UTC +00:00], ["name", "Apple"], ["page", ""], ["updated_at", Sat, 17 Mar 2012 23:14:34 UTC +00:00], ["website", ""]]

  def update
    @brand = Brand.find(params[:id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @brand = Brand.find(params[:id])
    @brand.destroy
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 1]]