app/controllers/brands_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def index
    @category = Category.find(params[:category_id])