app/controllers/influences_controller.rb

SELECT "influences".* FROM "influences"
---
  def index
    @influences = Influence.all

SELECT "influences".* FROM "influences" WHERE "influences"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @influence = Influence.find(params[:id])

SELECT "consumers".* FROM "consumers" WHERE "consumers"."id" = ? LIMIT 1  [["id", "6"]]
---
  def new
    @consumer = Consumer.find(params[:consumer_id])

SELECT "influences".* FROM "influences" WHERE "influences"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @influence = Influence.find(params[:id])

SELECT "consumers".* FROM "consumers" WHERE "consumers"."id" = ? LIMIT 1  [["id", "6"]]
INSERT INTO "influences" ("created_at", "fan", "influence", "mentions", "networkReplies", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 17 Mar 2012 23:18:46 UTC +00:00], ["fan", true], ["influence", 6], ["mentions", 3], ["networkReplies", 2], ["updated_at", Sat, 17 Mar 2012 23:18:46 UTC +00:00]]
---
  def create
    @consumer = Consumer.find(params[:consumer_id])
    @influence = @consumer.influences.build(params[:influence])

    respond_to do |format|
      if @influence.save

SELECT "influences".* FROM "influences" WHERE "influences"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "influences" SET "brand_id" = 1, "updated_at" = '2012-03-18 00:36:46.685177' WHERE "influences"."id" = 4
---
  def update
    @influence = Influence.find(params[:id])

    respond_to do |format|
      if @influence.update_attributes(params[:influence])

SELECT "influences".* FROM "influences" WHERE "influences"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "influences" WHERE "influences"."id" = ?  [["id", 1]]
---
  def destroy
    @influence = Influence.find(params[:id])
    @influence.destroy